In [31]:

!pip install pandas

Requirement already satisfied: pandas in e:\users\shree\anaconda3\lib\site-packages (2.1.4)
Requirement already satisfied: numpy<2,>=1.23.2 in e:\users\shree\anaconda3\lib\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in e:\users\shree\anaconda3\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in e:\users\shree\anaconda3\lib\site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in e:\users\shree\anaconda3\lib\site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in e:\users\shree\anaconda3\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)

In [32]:
import pandas as pd

In [63]:
import pandas as pd
dic1= {
    "name":['kaushik','vedant','sumit'],
    "marks":[89,56,42],
    "city":['nagpur' , 'mumbai', 'pune']
    }
df = pd.DataFrame(dic1)
df

      name  marks    city
0  kaushik     89  nagpur
1   vedant     56  mumbai
2    sumit     42    pune

In [65]:
df = pd.Series(dic1)
df

name     [kaushik, vedant, sumit]
marks                [89, 56, 42]
city       [nagpur, mumbai, pune]
dtype: object

In [57]:
df

      name  marks    city
0  kaushik     89  nagpur
1   vedant     56  mumbai
2    sumit     42    pune

In [54]:
import pandas as pd

# Assuming dic1 is your dictionary
dict1= {
    "name":['kaushik','vedant','sumit'],
    "marks":[89,56,42],
    "city":['nagpur' , 'mumbai', 'pune']
    }

# Correctly creating a Pandas Series
df = pd.Series(dic1)

print(df)

name     [kaushik, vedant, sumit]
marks                [89, 56, 42]
city       [nagpur, mumbai, pune]
dtype: object

In [55]:
import pandas as pd

# Assuming dic1 is your dictionary
dic1 = {
    "name":['kaushik','vedant','sumit'],
    "marks":[89,56,42],
    "city":['nagpur' , 'mumbai', 'pune']
}

# Correctly creating a Pandas Series
df = pd.DataFrame(dic1)

print(df)

      name  marks    city
0  kaushik     89  nagpur
1   vedant     56  mumbai
2    sumit     42    pune

In [67]:
import pandas as pd

# Your dictionary
dic1 = {
    "name": ['kaushik', 'vedant', 'sumit'],
    "marks": [89, 56, 42],
    "city": ['nagpur', 'mumbai', 'pune']
}

# Correctly creating a Pandas DataFrame
df = pd.DataFrame(dic1)

print(df)

      name  marks    city
0  kaushik     89  nagpur
1   vedant     56  mumbai
2    sumit     42    pune

In [68]:
df.head(2)

      name  marks    city
0  kaushik     89  nagpur
1   vedant     56  mumbai

In [70]:
df.tail(2)

     name  marks    city
1  vedant     56  mumbai
2   sumit     42    pune

In [71]:
df.describe()

           marks
count   3.000000
mean   62.333333
std    24.131584
min    42.000000
25%    49.000000
50%    56.000000
75%    72.500000
max    89.000000

In [72]:
df[['name','city']]

      name    city
0  kaushik  nagpur
1   vedant  mumbai
2    sumit    pune

In [73]:
df.replace("",0)

      name  marks    city
0  kaushik     89  nagpur
1   vedant     56  mumbai
2    sumit     42    pune